<template>
  <div>
    <a-typography style="text-align: left; margin-top: 4px">
      <a-typography-title>Brute force attack</a-typography-title>
      <a-typography-paragraph>
        <a-typography-text mark><b>Brute force attack</b></a-typography-text>
        - це метод криптоаналізу, який полягає в систематичному переборі всіх
        можливих комбінацій паролів або ключів для виявлення правильного. Цей
        метод використовується для злому захищених даних, таких як паролі до
        облікових записів, зашифрованих файлів тощо. Ім’я походить від «силових»
        спроб отримати доступ до даних користувача. Попри те, що це старий метод
        кібератаки, він залишається досить популярним серед хакерів.
        <b>Є декілька різновидів даної атаки, які можуть бути застосовані:</b>
      </a-typography-paragraph>
      <a-typography-paragraph>
        <a-typography-title :level="4"
          >1. Звичайна Brute force атака</a-typography-title
        >
        <a-typography-text
          >При звичайній brute force атаці зловмисники можуть використовувати
          спеціальний софт для генерування випадкових комбінацій цифр, букв,
          спеціальних символів, до поки не підбере правильний пароль до
          облікового запису. Проте, він може бути ефективним лише у випадку
          коротких і не складних паролів, в іншому випадку такий метод може
          займати дуже багато часу, перед тим як знайти правильну
          відповідь.</a-typography-text
        >
        <a-typography-title :level="4"
          >2. Атака «Перебору за словником»</a-typography-title
        >
        <a-typography-text
          >На відміну від попереднього методу, «Перебір за словником» не
          підбирає випадково згенеровані паролі, а використовує певний набір
          часто вживаних слів, фраз і числових комбінацій. Передавши у
          спеціальне програмне забезпечення попередньо визначений набір слів, ПЗ
          буде комбінувати елементи зі словника до поки не знайде слушну
          комбінацію. У більшості випадків у цих словниках використовують:
          популярні імена домашніх тварин, назви музичних груп, спортивні
          команди, імена тощо. Такі паролі несуть певний сенс для користувача,
          тому їх простіше запам’ятати, але через це виникає така
          вразливість.</a-typography-text
        >
        <a-typography-title :level="4"
          >3. Гібридна Brute force атака</a-typography-title
        >
        <a-typography-text
          >Гібридною brute force атакою є комбінація двох попередніх атак.
          Використовується певний словник слів, але комбінації можуть
          створюватися не лише з цих слів, а і з випадкових.</a-typography-text
        >
        <a-typography-title :level="4"
          >4. Зворотна Brute force атака</a-typography-title
        >
        <a-typography-text
          >Як можна здогадатися по назві даного методу підбір відбувається за
          іменем облікового запису, а не паролю. У такому випадку, зловмисник
          володіє паролем, який може підходити до одного з акаунтів, після чого
          відбувається перебір імен облікових записів. Також, даний метод може
          бути використаний для злому хешу паролів.
        </a-typography-text>
        <a-typography-title :level="4"
          >5. Credential stuffing</a-typography-title
        >
        <a-typography-text
          >Цей метод атаки використовується при наявності у зловмисника
          облікових даних користувача з інших сервісів. Тобто, у злочинців може
          бути база даних користувачів з їхніми поштовими скриньками й паролями.
          Здобути ці дані можливо через соціальну інженерію, злом бази даних
          певного сервісу, або через покупку цієї інформації у недоброчесного
          розробника. Після цього за допомогою певного ПЗ ці облікові дані
          будуть вводитись на різних сайтах для отримання доступу до них.
          Захиститись від цього можна, використовуючи унікальні паролі для
          кожного сайту.
        </a-typography-text>
      </a-typography-paragraph>
    </a-typography>
    <div style="display: flex; flex-direction: column; align-items: center">
      <a-image
        :width="400"
        style="margin-top: 4px"
        src="https://images.spiceworks.com/wp-content/uploads/2022/05/10131245/Critical-Steps-of-a-Brute-Force-Attack.png"
      />
      <a-typography-text><b>Ілюстрація роботи brute force</b></a-typography-text>
    </div>
  </div>
</template>

<script>
import { defineComponent } from "vue";

export default defineComponent({
  name: "brute-force-base-info",
  setup() {
    return {};
  },
});
</script>

<style scoped></style>
