<template>
  <div>
    <a-typography style="text-align: left; margin-top: 4px">
      <a-typography-title>JSON Web Token</a-typography-title>
      <a-typography-paragraph>
        <a-typography-text mark
          ><b>JSON Web Tokens (JWTs)</b></a-typography-text
        >
        – стандартизований спосіб безпечної відправки даних між двома сторонами.
        Вони містять інформацію, закодовану у форматі JSON. Ці заяви допомагають
        поділитися конкретними деталями між залученими сторонами. За своєю суттю
        JWT є механізмом перевірки автентичності деяких даних JSON. Це можливо,
        оскільки кожен JWT підписаний за допомогою криптографії, щоб
        гарантувати, що його вміст не був підроблений під час передачі або
        зберігання. Важливо відзначити, що JWT гарантує володіння даними, але не
        шифрування. Причина в тому, що JWT може бути помічений кожним, хто
        перехоплює токен, тому що він серіалізований, а не зашифрований.
        Настійно рекомендується використовувати JWT з HTTPS, практика, яка
        поширюється на загальну безпеку вебсайтів. HTTPS не тільки захищає
        конфіденційність вмісту JWT під час передачі, але також забезпечує
        ширший рівень захисту даних під час транзиту.
      </a-typography-paragraph>
      <a-typography-paragraph>
        Щоб зрозуміти проблему, яку JWT прагне вирішити, розглянемо, як
        традиційно обробляється аутентифікація та авторизацію. Під час входу
        користувачі реєструються зі своїми обліковими даними. Сервер
        аутентифікує користувача, часто перевіряючи введені облікові дані в базі
        даних. При успішній аутентифікації генерується унікальний ідентифікатор
        сеансу і відправляється назад клієнту. Потім цей ідентифікатор сеансу
        зберігається на пристрої користувача. Для кожного наступного запиту
        користувача ідентифікатор сеансу надсилається на сервер з файлу cookie,
        або як заголовок. Сервер шукає ідентифікатор сеансу у своїй базі даних
        для ідентифікації користувача та визначення рівня авторизації.
        Ідентифікація користувача та деталі авторизації витягуються з токена, що
        виключає необхідність постійного пошуку в базі даних. Використання JWT
        як session token може здатися хорошим рішенням, але є досить багато
        недоліків у використанні JWT як механізму сеансу. Ось декілька проблем,
        пов'язаних з використанням JWT як механізму сеансу.
      </a-typography-paragraph>
      <a-typography-paragraph>
        <a-typography-title :level="4">1. Обмеження розміру</a-typography-title>
        <a-typography-text
          >У багатьох складних додатках вам може знадобитися зберігати багато
          різної інформації. При використанні з файлами cookie це або додає
          багато витрат на запит, або перевищує дозволене місце для зберігання
          файлів cookie, що є 4KB. Це часто змушує людей зберігати JWT у
          локальному сховищі. Зберігання конфіденційних даних у localStorage
          може супроводжуватися багатьма проблемами. Для невеликого контексту,
          якщо зберігати токен всередині localStorage, дані доступні будь-яким
          скриптам і подіям всередині сторінки додатка. XSS атака може дати
          зовнішньому нападнику доступ до токена.</a-typography-text
        >
      </a-typography-paragraph>
      <a-typography-paragraph>
        <a-typography-title :level="4">2. Менш безпечний</a-typography-title>
        <a-typography-text
          >Попри того, що ризики безпеки мінімізуються шляхом відправки JWT за
          допомогою протоколу HTTPS, завжди є можливість, що його зможуть
          перехопити й розшифрувати дані, визначивши дані користувача. Треба
          пам’ятати, що JWT можуть бачити всі, хто перехоплює токен, тому що він
          серіалізований, а не зашифрований.</a-typography-text
        >
      </a-typography-paragraph>
      <a-typography-paragraph>
        <a-typography-title :level="4"
          >3. Недійсність токена</a-typography-title
        >
        <a-typography-text
          >Скасування певного токена у JWT також може бути проблемою. Це тому,
          що вони автономні й не мають центрального органу для визнання
          недійсними, на відміну від традиційних сесій. Ця проблема є важливою –
          наприклад, при роботі з поганими користувачами призупинення їх
          облікових записів не негайно скасовує їх доступ, оскільки JWT
          зберігаються до закінчення терміну дії. Одним із запропонованих рішень
          є зміна секретного ключа сервера, що призведе до недійсності всіх JWT.
          Однак такий підхід може бути незручним для користувачів, оскільки це
          призведе до того, що токени всіх користувачів закінчаться без причини,
          що змусить проводити повторну авторизацію. Ще одна пропозиція –
          зберегти список недійсних токенів у базі даних. Однак це підірве
          вбудовану функціональність JWT, і перевірка кожного запиту з цього
          списку зменшить ефективність, яку пропонує JWT.</a-typography-text
        >
      </a-typography-paragraph>
      <a-typography-paragraph>
        Всупереч усім ризикам, які за собою несе даний метод, важливо розуміти
        коли потрібно використовувати JWT, а не файли cookie. Як правило дані
        токени є найбільш корисними, коли: токен не довговічний,
        використовується тільки один раз, сервер додатків використовує сеанси.
        Поширеним методом використання є механізм аутентифікації API. Наведемо
        приклад отримання токена з сервера. Спочатку користувач вводить логін та
        пароль до відкритого методу “/login”, після перевірки правильності
        введених даних, на клієнт відправляється токен, який зберігається на
        клієнті в cookie. За допомогою цього токену користувач зможе надсилати
        запити до закритих методів API для отримання приватної інформації.
      </a-typography-paragraph>
    </a-typography>
  </div>
</template>

<script>
import { defineComponent } from "vue";

export default defineComponent({
  name: "jwt-base-info",
  setup() {
    return {};
  },
});
</script>

<style scoped></style>
